{
    "admitreq": {
        "paragraphs": [
            { "style": "p", "content": "Grade 12 or equivalent graduate or Mature Student status (19 years of age or over with at least one year out of high school) and subject to the discretion of the College Director. Mature Students will be required to complete an entrance examination to properly assess their personal strengths and weaknesses. Good command of the English language, and be able to work with an individualized learning system, particularly the Integrated Learning™ System, or online learning as applicable, and to follow instructions. An admissions interview will be administered to determine if the applicant has the required interest, motivation, and entry-level skills to take this program." }

        ]
    },
    "programhighlights": {
        "paragraphs": [
            { "style": "p", "content": "This entry-level program will prepare the candidate for three industry-recognized certifications. The popular A+ Certification (by CompTIA) is highly recognized for excellence in hardware repair and maintenance, and operating system installation and support. The CompTIA Network+ certification assures the ability to install and maintain a network. In addition, the candidate will prepare for Microsoft Certified Solutions Associate (MCSA) Windows certification exams. The MCSA Windows certification demonstrates knowledge and skills in working with Windows client operating system and validates ability to support end users and maintain systems and mobile devices that run Windows. * Not all programs are offered at each location." }

        ]
    },
    "careeropp": {
        "paragraphs": [
            { "style": "p", "content": "With further studies the graduate may pursue a career as:" },
            { "ul_start": "true" },
            { "style": "li", "content": "Internet Web site technician" },
            { "style": "li", "content": "LAN (local area network) administrator" },
            { "style": "li", "content": "LAN (local area network) technician, Web technician" },
            { "style": "li", "content": "Computer network technician" },
            { "style": "li", "content": "Computer network technician supervisor" },
            { "style": "li", "content": "Data centre operator" },
            { "style": "li", "content": "Network/System administrator" },
            { "style": "li", "content": "Network support technician" },
            { "ul_end": "true" }

        ]
    },
    "corecourses": {
        "paragraphs": [
            
            { "ul_start": "true" },
            { "style": "li", "li_title": "Keyboarding", "content": "Minimum 25 words per minute (WPM)." },
            { "style": "li", "li_title": "Operating Systems", "content": "Intermediate level of proficiency with Windows OS" },
            { "style": "li", "li_title": "Software Development Industry", "content": "Computer and Technology Basics for Developers, Overview of Software Development" },
            { "style": "li", "li_title": "Software and Web Development Skills", "content": "Version Control, HTML, CSS and Bootstrap, JavaScript, Visual Studio, C#, .NET Framework" },
            { "style": "li", "li_title": "Database Skills", "content": "Intermediate level of proficiency in Microsoft Access, Database and SQL" },
            { "style": "li", "li_title": "Presentations", "content": "Basic level of proficiency in Microsoft PowerPoint" },
            { "style": "li", "li_title": "Word Processing and Spreadsheets", "content": "Basic level of proficiency in Microsoft Word and Microsoft Excel" },
            { "style": "li", "li_title": "Office Skills", "content": "Personal Computer Fundamentals, basic level of proficiency in Microsoft Outlook and Internet Fundamentals" },
            { "style": "li", "li_title": "Business Skills", "content": "Customer Service, Project Management" },
            { "ul_end": "true" }
        ]
    },
    "programtype": "Diploma",
    "salarystart": 36400,
    "salaryend": 90000
}