{     "admitreq": {         "paragraphs": [             { "style": "p", "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instruction. An admissions interview will be administered to determine if the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them. Part-time students may set their own schedules to a minimum of two training sessions per week. These times may be scheduled during the day, evenings, or on weekends." }          ]     },     "programhighlights": {         "paragraphs": [             { "style": "p", "content": "This program provides students with the necessary skills and knowledge required to provide supervision in the payroll department. Students become familiar with basic payroll practices and procedures, and are eligible to apply to the Canadian Payroll Association (CPA) for the Payroll Compliance Practitioner (PCP) certification. In addition to accounting and payroll expertise, students gain skills and experience in business correspondence, office procedures, business supervisory skills, and performing a job search." }          ]     },     "careeropp": {         "paragraphs": [             { "style": "p", "content": "Accounting and Payroll Administrators are employed by banks, other financial institutions, insurance companies, and other establishments throughout the private and public sectors. Careers that correspond with the skills learned in this program include:" },             { "ul_start": "true" },             { "style": "li", "content": "Payroll Supervisor" },             { "style": "li", "content": "Accounting Supervisor" },             { "style": "li", "content": "Bookkeeping Supervisor" },             { "ul_end": "true" }         ]     },     "corecourses": {         "paragraphs": [              { "ul_start": "true" },             { "style": "li", "li_title": "Operating Systems", "content": "Basic level of proficiency with Windows OS" },             { "style": "li", "li_title": "Word Processing", "content": "Intermediate  level of proficiency in Microsoft Word" },             { "style": "li", "li_title": "Spreadsheets", "content": "Intermediate  level of proficiency in Microsoft Excel" },             { "style": "li", "li_title": "Office Skills", "content": "Basic Bookkeeping Levels 1 and 2, basic level of proficiency in Microsoft Outlook, and Office Procedures Level 1" },             { "style": "li", "li_title": "Accounting", "content": "Sage 50 Premium Accounting, Payroll Fundamentals Levels 1 and 2, and Payroll Compliance Legislation" },             { "style": "li", "li_title": "Database Management", "content": "Basic level of proficiency in Microsoft Access." },             { "style": "li", "li_title": "Simulations and Drills", "content": "Practical Applications – 2 Units" },             { "style": "li", "li_title": "Business Skills", "content": "Grammar Essentials for Business Writing, Business Correspondence Levels 1 and 2, Customer Service, Business Verbal Communication, and Business Supervisory Skills" },             { "style": "li", "li_title": "Employability Skills", "content": "Employment Success Strategies, Job Search and Résumé Writing, and Thought Patterns for a Successful Career" },             { "ul_end": "true" }         ]     },     "programtype": "Diploma",     "salarystart": 35375,     "salaryend": 59987 }