{
    "programname": "ACCOUNTING ADMINISTRATOR DIPLOMA WITH SAGE",
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "A British Columbia Secondary School Diploma or equivalent with prior education in English at grade 10 level or higher."
            },
            {
                "style": "b",
                "content": "OR"
            },
            {
                "style": "p",
                "content": "Mature students who pass an entrance evaluation demonstrating sufficient ability (i.e., English comprehension and math skills) to undertake the program."
            },
            {
                "style": "p",
                "content": "All applicants must demonstrate English proficiency through one of the above requirements or through an English language assessment (IELTS 5.5 or equivalent)."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "The objective of this program is to provide the student with opportunities to acquire and apply the knowledge of bookkeeping, office skills, and accounting to meet the demands of today's business."
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Computerized accounting is a growing area. Excellent opportunities exist for skilled people. Graduates can become employed in the accounting department of a large company as an assistant or be in charge of the accounts in a smaller enterprise."
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Keyboarding",
                "content": "Minimum 25 words per minute (WPM)."
            },
            {
                "style": "li",
                "li_title": "Operating Systems",
                "content": "Basic level of proficiency with Windows OS"
            },
            {
                "style": "li",
                "li_title": "Word Processing",
                "content": "Basic level of proficiency in Microsoft Word"
            },
            {
                "style": "li",
                "li_title": "Spreadsheets",
                "content": "Intermediate level of proficiency in Microsoft Excel"
            },
            {
                "style": "li",
                "li_title": "Simulations and Drills",
                "content": "Practical Applications – 2 Units"
            },
            {
                "style": "li",
                "li_title": "Accounting",
                "content": "Sage 50 Premium Accounting, QuickBooks, Sage 300 General Ledger, Sage 300 Accounts Receivable, and Sage 300 Accounts Payable"
            },
            {
                "style": "li",
                "li_title": "Office Skills",
                "content": "Basic Bookkeeping Levels 1 and 2, Internet Fundamentals, Office Procedures Level 1, and basic level of proficiency in Microsoft Outlook"
            },
            {
                "style": "li",
                "li_title": "Database Management",
                "content": "Basic level of proficiency in Microsoft Access"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Business Math, Customer Service, Grammar Essentials for Business Writing, and Workplace Success/Intrapreneurship"
            },
            {
                "style": "li",
                "li_title": "Employability Skills",
                "content": "Job Search and Résumé Writing and Thought Patterns for a Successful Career"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "programtype": "Diploma",
    "salarystart": 34348,
    "salaryend": 57650
}