{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instruction. An admissions interview will be administered to determine if the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them. Part-time students may set their own schedules to a minimum of two training sessions per week. These times may be scheduled during the day, evenings, or on weekends."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "The Business Administration Diploma is designed to prepare students for the demands of today's fast-paced business environment. Its objective is to expose students to a vast array of business knowledge, management and administration skills, and practical tools that will assist them in dealing with situations within a business-related career. Courses focus on professional skills required by today's employers, including knowledge of how businesses utilize technology, e-commerce, Business Correspondence, office procedures, project management, and employment success strategies."
            },
            {
                "style": "p",
                "content": "This program provides students with:"
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "content": "A solid foundation in basic principles of a business environment, including current computer applications, marketing, accounting and business law."
            },
            {
                "style": "li",
                "content": "An introduction to the most relevant aspects of business management and administration."
            },
            {
                "style": "li",
                "content": "Professional skills in high demand by employers. These skills include: teamwork, communication, customer service, leadership, research and problem solving."
            },
            {
                "style": "li",
                "content": "A solid knowledge of business practices and principles. It also develops the student's ability to relate and apply this knowledge to current social and economic conditions."
            },
            {
                "style": "li",
                "content": "Proficiency in Microsoft Office Applications and accounting."
            },
            {
                "ul_end": "true"
            },
            {
                "style": "p",
                "content": "Please note that the focus of this program is to train individuals for entry-level support and/or management trainee positions. It will also provide the skills to progress into management-level careers, given the proper combination of skills,experience, and personal attributes."
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "his program provides the student with a range of business knowledge and skills, which cross several disciplines, resulting in a well-rounded and highly skilled employee. Graduates of this program are prepared for a variety of entry-level administrative and management trainee positions in a broad range of employment settings, specializing in those areas of interest, experience, and greatest ability. Careers in accounting and finance, marketing, production and operations, human resources, and general administration are available to those students who possess the proper combination of business skills, experience, personal ability, and aptitude."
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Business Essentials, Marketing and Sales, Customer Service, Management Fundamentals, Business Supervisory Skills, Human Resources Management, Grammar Essentials for Business Writing, Business in the Digital Age, Project Management Fundamentals Level 1, Project Levels 1 and 2, and Business Presentations"
            },
            {
                "style": "li",
                "li_title": "Office Skills",
                "content": "Basic Bookkeeping Level 1"
            },
            {
                "style": "li",
                "li_title": "Accounting",
                "content": "QuickBooks Premier"
            },
            {
                "style": "li",
                "li_title": "Job Readiness/Employability Skills",
                "content": "Employment Success Strategies and Thought Patterns for a Successful Career"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "programtype": "Diploma",
    "salarystart": 32548,
    "salaryend": 65365
}