{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instruction. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "The objective of this program is to provide the student with opportunities to acquire and apply office skills and knowledge of business office concepts to meet the demands of today's workplace."
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Career opportunities are almost unlimited. Efficient and responsible Business Office Skills personnel are an integral and invaluable part of today's office environment. "
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Keyboarding",
                "content": "Minimum 40 words per minute (WPM)."
            },
            {
                "style": "li",
                "li_title": "Operating Systems",
                "content": "Advanced level of proficiency in a Windows operating system"
            },
            {
                "style": "li",
                "li_title": "Word Processing",
                "content": "Intermediate level of proficiency in Microsoft Word"
            },
            {
                "style": "li",
                "li_title": "Spreadsheets",
                "content": "Intermediate level of proficiency in Microsoft Excel"
            },
            {
                "style": "li",
                "li_title": "Graphics/Presentation",
                "content": "Basic level of proficiency in Microsoft PowerPoint and Microsoft Publisher"
            },
            {
                "style": "li",
                "li_title": "Data Management",
                "content": "Basic level of proficiency in Microsoft Access"
            },
            {
                "style": "li",
                "li_title": "Simulations and Drills",
                "content": "Practical Applications – 2 Units"
            },
            {
                "style": "li",
                "li_title": "Accounting",
                "content": "QuickBooks Premier"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Customer Service, Grammar EssentialsforBusiness Writing, Business Correspondence Level 1, and Business Math"
            },
            {
                "style": "li",
                "li_title": "Office Skills",
                "content": "Personal Computer Fundamentals for End Users, Internet Fundamentals, basic level of proficiency in Microsoft Outlook,BasicBookkeeping Level 1, and Office Procedures Levels 1 and 2"
            },
            {
                "style": "li",
                "li_title": "Employability Skills",
                "content": "Job Search and Résumé Writing and Thought Patterns for a Successful Career"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "programtype": "Diploma",
    "salarystart": 32548,
    "salaryend": 65365
}