{
    "admitreq": {
        "paragraphs": [{ "style": "p", "content": "A British Columbia Secondary School Diploma or equivalent with prior education in English at grade 10 level or higher." },
            { "style": "p", "content": "OR" },
            { "style": "p", "content": "Mature students who pass an entrance evaluation demonstrating sufficient ability (i.e., English comprehension and math skills) to undertake the program." },
            { "style": "p", "content": "All applicants must demonstrate English proficiency through one of the above requirements or through an English language assessment (IELTS 5.5 or equivalent)." },
            { "style": "h2", "content": "Co-Op Work Experience" },
            { "style": "p", "content": "In addition to the coursework, students are required to successfully complete 880 hours of co-op work experience to obtain a diploma. Co-op placements may be located throughout British Columbia." }
        ]
    },
    "programhighlights": {
        "paragraphs": [{ "style": "p", "content": "The Business Management Certificate is designed to prepare students for management and supervisory level positions in today's fast-paced business environment. Its objective is to help students who are seeking to reenter the business sector, or who are currently working and wish to upgrade their business and supervisory skills in order to further their career. Courses focus on professional skills required by today's employers, including knowledge of how businesses utilize             technology, e-commerce, business supervisory skills, business correspondence, project management, customer service, and marketing. This program provides students with:" },
            { "ul_start": "true" },
            { "style": "li", "content": "A solid foundation in basic principles of a business environment, including current computer applications, marketing and sales, and customer service." },
            { "style": "li", "content": "An introduction to the most relevant aspects of business management and administration." },
            { "style": "li", "content": "Professional skills in high demand by employers. These skills include: 'teamwork, communication, customer service, leadership, research, and problem solving.' "},
            { "style": "li", "content": "A solid knowledge of business practices and principles.It also develops the student 's ability to relate and apply this knowledge to their current work environment." },
            { "ul_end": "true" }
        ]
    },
    "careeropp": { "paragraphs": [{ "style": "p", "content": "Students are prepared for their career with a range of business knowledge and skills, resulting in a competent and skilled team leader. Graduates of this program are prepared for a variety of supervisory and management trainee positions in a broad range of employment settings, specializing in those areas of interest, experience, and greatest ability. Careers in accounting and finance, marketing, production and operations, human resources, and general administration are available to those graduates who possess the proper combination of business skills, experience, personal ability, and aptitude." }] },
    "corecourses": {
        "paragraphs": [{ "style": "h3", "content": "YEAR 1" },
            { "ul_start": "true" },
            { "style": "li", "li_title": "Keyboard Skill Building", "content": "Keyboarding Minimum 25 words per minute (WPM)." },
            { "style": "li", "li_title": "Office Skills", "content": "Personal Computer Fundamentals, Basic Bookkeeping Levels 1 and 2, Internet Fundamentals, Office Procedures Levels 1 and 2, and basic level of proficiency in Microsoft Outlook" },
            { "style": "li", "li_title": "Operating Systems", "content": "Basic level of proficiency in a Windows operating system" },
            { "style": "li", "li_title": "Word Processing", "content": "Intermediate level of proficiency in Microsoft Word" },
            { "style": "li", "li_title": "Spreadsheets", "content": "Intermediate level of proficiency in Microsoft Excel" },
            { "style": "li", "li_title": "Accounting", "content": "Sage 50 Premium Accounting" },
            { "style": "li", "li_title": "Business Skills", "content": "Business Essentials, Marketing and Sales, Customer Service, Grammar Essentials for Business Writing, Business Correspondence Levels 1 and 2, Business Math, Business Financial Management, Human Resource Management, and Business Law & Ethics" },
            { "style": "li", "li_title": "Employability Skills", "content": "Employment Success Strategies and Thought Patterns for a Successful Career" },
            { "ul_end": "true" },
            { "style": "p", "content": "YEAR 2" },
            { "ul_start": "true" },
            { "style": "li", "li_title": "Office Skills", "content": "Basic level of proficiency in Microsoft Outlook" },
            { "style": "li", "li_title": "Graphics/Presentation", "content": "Basic level of proficiency in Microsoft PowerPoint" },
            { "style": "li", "li_title": "Database Management", "content": "Basic level of proficiency in Microsoft Access" },
            { "style": "li", "li_title": "Business Skills", "content": "Project Management Fundamentals Level 1, Business Economics, Business in the Digital Age, and Business Administration Integrative Project" },
            { "style": "li", "li_title": "Simulations and Drills", "content": "Practical Applications – 2 Units" },
            { "style": "li", "li_title": "Job readiness/Employability Skills", "content": "Job Search and Résumé Writing" },
            { "ul_end": "true" }
        ]
    },
    "salarystart": 28529,
    "salaryend": 51357
}