{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instruction. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "This program prepares students to deal with the problems they may encounter when servicing Personal Computers. It provides in-depth  of computer hardware. Students will have practical hands-on experience in troubleshooting computer problems and assembling a computer. This program prepares students to take the CompTIA A+, Network+, and Security+ certification exams. "
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Graduates of this program will find opportunities working as bench technicians for small to medium sized PC or electronics companies as well as large PC related manufacturing operations. They may also find positions in computer sales and service. After some experience, they may wish to open their own computer repair service."
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Upon completion of the program the participant must demonstrate the following core competencies:"
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Keyboarding",
                "content": "Minimum 25 words per minute (WPM)."
            },
            {
                "style": "li",
                "li_title": "Operating Systems",
                "content": "Advanced level of proficiency in a Windows operating system"
            },
            {
                "style": "li",
                "li_title": "Word Processing",
                "content": "Basic level of proficiency in Microsoft Word"
            },
            {
                "style": "li",
                "li_title": "Spreadsheets",
                "content": "Basic level of proficiency in Microsoft Excel"
            },
            {
                "style": "li",
                "li_title": "Data Management",
                "content": "Basic level of proficiency in Microsoft Access"
            },
            {
                "style": "li",
                "li_title": "Office Skills",
                "content": "Internet Fundamentals and basic level of proficiency in Microsoft Outlook"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Grammar Essentials for Business Writing, Customer Service, and Workplace Success/Intrapreneurship"
            },
            {
                "style": "li",
                "li_title": "Job Readiness/Employability Skills",
                "content": "Job Search and Résumé Writing and Thought Patterns for a Successful Career"
            },
            {
                "style": "li",
                "li_title": "PC Troubleshooting",
                "content": "CompTIA A+ 220-1001 and CompTIA A+ 220-1002"
            },
            {
                "style": "li",
                "li_title": "Computer Networking",
                "content": "CompTIA Network+ and CompTIA Security+"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "salarystart": 29028,
    "salaryend": 62139
}