{
    "admitreq": {
        "paragraphs": [
            { "style": "p", "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions. All applicants whose first language is not English must provide proof of English proficiency." },
            { "style": "p", "content": "An admissions interview and entrance essay will be administered to determine if the applicant has the required interest, motivation, and entry-level skills to take this program." },
            { "style": "p", "content": "Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them." }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            { "style": "p", "content": "In the Graphic Designer diploma program, students learn the software programs that every professional designer needs to know: Adobe Photoshop, Illustrator, and InDesign. Students learn techniques for creating digital images, illustrations, and layouts, and they develop a strong theoretical foundation in color, typography, and composition." },
            { "style": "p", "content": "Students gain hands-on experience with a wide range of graphic design projects, ranging from photo editing and logo design, to poster design, magazine layouts, and more. Students learn the essentials of print production and how to prepare themselves for entry into the job market." },
            { "style": "p", "content": "Students gain hands-on experience with a wide range of graphic design projects, ranging from photo editing and logo design, to poster design, magazine layouts, and more. Students learn the essentials of print production and how to prepare themselves for entry into the job market." },
            { "ul_start": "true" },
            { "style": "li", "content": "A foundation in the principles of color theory, typography, and page composition." },
            { "style": "li", "content": "Professional skills in the essential tools of the graphic designer: Adobe Photoshop, Illustrator, and InDesign." },
            { "style": "li", "content": "Proficiency in key Microsoft Office applications." },
            { "ul_end": "true" }

        ]
    },
    "careeropp": {
        "paragraphs": [
            { "style": "p", "content": "Graduates of the program may pursue positions such as:" }, 
            { "ul_start": "true" },
            { "style": "li", "content": "Graphic Designer" },
            { "style": "li", "content": "Graphic Artist" },
            { "style": "li", "content": "Layout Artist" },
            { "style": "li", "content": "Layout Designer" },
            { "ul_end": "true" }





        ]
    },
    "corecourses": {
        "paragraphs": [

        ]
    },
    "salarystart": 32136,
    "salaryend": 79000
}