{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instruction. An admissions interview will be administered to determineif the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them. Part-time students may set their own schedules to a minimum of two training sessions per week. These times may be scheduled during the day, evenings, or on weekends."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "The Marketing Coordinator Diploma is designed to prepare students for entry-level marketing support positions relating to a variety of integrated marketing and communication activities. Its objective is to expose studentsto a broad range of marketing knowledge and processes, administration skills, and practical tools that will assist them in dealing with situations within a marketing related career. The program will provide the skills to progress into manager-level careers,given the proper combination of skills, experience, personal attributes, and additional training. This program provides students with: "
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "content": "Leading-edge marketing skills and current course curriculumrelevant to today's businesses in Canada, and in some cases, internationally."
            },
            {
                "style": "li",
                "content": "An introduction to the most relevant aspects of marketing support and administration."
            },
            {
                "style": "li",
                "content": "Professional skills inhigh demand by employers. These skills include: teamwork, communication, customer service, leadership, research and problem solving."
            },
            {
                "style": "li",
                "content": "A solid knowledge of marketing practices and principles. It also develops the student'sability to relate and apply this knowledge to the many facets of marketing."
            },
            {
                "style": "li",
                "content": "Proficiency in Microsoft Office Applications and graphics."
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "This program provides students with a range of marketing knowledge and skills that prepare them for many aspects of marketing. Graduates of this program are prepared for entry-level marketing support and administrative positionsin a variety of industries, specializing in those areas of greatest interest, experience, and ability. Careers in marketing communications, such as marketing, advertising, direct marketing, public relations, and market research are available to thosestudents who possess the proper combination of marketing skills, experience, personal ability, and aptitude. Careers that correspond with the skills learned in this program include: "
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "content": "Marketing & Events Coordinator"
            },
            {
                "style": "li",
                "content": "Sales & Marketing Coordinator"
            },
            {
                "style": "li",
                "content": "Direct Marketing Coordinator"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "",
                "content": ""
            },
            {
                "style": "li",
                "li_title": "Graphic/Presentation",
                "content": "Advanced level of proficiency in Microsoft PowerPoint, Microsoft Publisher, Photoshop Basics, and IllustratorBasics "
            },
            {
                "style": "li",
                "li_title": "Accounting",
                "content": "QuickBooks Premier "
            },
            {
                "style": "li",
                "li_title": "Simulations and Drills",
                "content": "Practical Applications – 2 Units "
            },
            {
                "style": "li",
                "li_title": "Office Skills",
                "content": "Basic Bookkeeping Level 1, and Office Procedures Levels 1 and 2 "
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Business Essentials, Marketing and Sales, Marketing Administration, Customer Service, Business Correspondence Levels1 and 2, Grammar Essentials for Business Writing, Business Math, Project Management Fundamentals Level 1, Microsoft Project Level 1, Business in the Digital Age, and Business Presentations "
            },
            {
                "style": "li",
                "li_title": "Job Readiness/EmployabilitySkills",
                "content": "Job Search and Résumé Writing, Thought Patterns For a Successful Career, and Employment Success Strategies "
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "salarystart": 32768,
    "salaryend": 55193
}