{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status with successful completion of the required test. Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions. Anadmissions interview will be administered to determine if the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may doso at times convenient to them."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "The goal of this program is to provide students with an in-depth knowledge of office procedures, communications, word processing, terminology and medical billing. Graduates of this program will find that they are an integralpart of the medical community and assist the healthcare team by building trust, and creating a safe environment for patients and their families while performing a variety of duties. "
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Medical Administrative Assistants work in doctors' offices, hospitals, medical clinics, pharmaceutical companies, government health agencies and a variety of other medical office settings. They are integral members of thehealth care delivery team and perform many administrative and some basic clinical procedures. Typical Job Titles include Medical Office Assistant, Medical Secretary, Medical Billing Clerk/Secretary, Medical Office Administrator, Medical Receptionist,Clinical Assistant, Ward Secretary and Booking Clerk."
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Upon completion of the program the participant must demonstrate the following core competencies:"
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Keyboarding",
                "content": "Minimum 40 words per minute (WPM)."
            },
            {
                "style": "li",
                "li_title": "Operating Systems",
                "content": "Basic level of proficiency in a Windows operating system"
            },
            {
                "style": "li",
                "li_title": "Word Processing",
                "content": "Intermediate level of proficiency in Microsoft Word"
            },
            {
                "style": "li",
                "li_title": "Spreadsheets",
                "content": "Intermediate level of proficiency in Microsoft Excel"
            },
            {
                "style": "li",
                "li_title": "Database Management",
                "content": "Basic level of proficiency in Microsoft Access"
            },
            {
                "style": "li",
                "li_title": "Office Skills",
                "content": "Personal Computer Fundamentals for End Users, Internet Fundamentals, basic level of proficiency in Microsoft Outlook, and Bookkeeping Level 1"
            },
            {
                "style": "li",
                "li_title": "Help Desk & Call Centre Skills",
                "content": "Telephone Communication Skills"
            },
            {
                "style": "li",
                "li_title": "Healthcare",
                "content": "Learning Medical Language and Medical Office Procedures"
            },
            {
                "style": "li",
                "li_title": "Simulations & Drills",
                "content": "Medical Receptionist PracticalSimulations and Practical Applications – 2 Units"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Customer Service, Grammar Essentials for Business Writing, and Business Correspondence Level 1"
            },
            {
                "style": "li",
                "li_title": "Job Readiness/EmployabilitySkills",
                "content": "Job Search and Resume Writing"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "salarystart": 25868,
    "salaryend": 49368
}