{
    "admitreq": { "paragraphs": [{ "style": "p", "content": "Prospective students must be Grade 12 graduates, or equivalent, or have Mature Student status (19 years of age or over with at least one year out of high school) and subject to the discretion of the college Director. Grade 12 or equivalent graduates who cannot supply appropriate proof and Mature Students will be required to complete an entrance examination to properly assess their personal strengths and weaknesses. The minimum passing grade for this examination is 75%." }] },
    "programhighlights": { "paragraphs": [{ "style": "p", "content": "The objective of this program is to provide the student with opportunities to acquire and apply the knowledge of business concepts and office skills to meet the demands of today’s business environment. * Not all programs are offered at each location." }] },
    "careeropp": { "paragraphs": [{ "style": "p", "content": "The computerized accounting sector is one of the fastest growing areas. Excellent opportunities exist for skilled persons." }] },
    "corecourses": {
        "paragraphs": [{ "ul_start": "true" },
            { "style": "li", "li_title": "Keyboarding", "content": "Minimum 25 words per minute (WPM)." },
            { "style": "li", "li_title": "Operating Systems", "content": "Basic level of proficiency with Windows OS" },
            { "style": "li", "li_title": "Word Processing", "content": "Basic level of proficiency in Microsoft Word" },
            { "style": "li", "li_title": "Spreadsheets", "content": "Advanced level of proficiency in Microsoft Excel" },
            { "style": "li", "li_title": "Accounting", "content": "Sage 50 Premium Accounting, Sage 300 Inventory Control and Order Entry, Sage 300 General Ledger, Sage 300 Accounts Receivable, Sage 300 Accounts Payable, and QuickBooks" },
            { "style": "li", "li_title": "Office Skills", "content": "Personal Computer Fundamentals, Basic Bookkeeping Levels 1 and 2, Office Procedures Level 1, and basic level of proficiency in Microsoft Outlook" },
            { "style": "li", "li_title": "Database Management", "content": "Basic level of proficiency in one database application." },
            { "style": "li", "li_title": "Business Skills", "content": "Business Math, Management Fundamentals, Customer Service, and Grammar Essentials for Business Writing" },
            { "style": "li", "li_title": "Simulations and Drills", "content": "Practical Applications – 3 Units" },
            { "style": "li", "li_title": "Employability Skills", "content": "Job Search and Résumé Writing and Thought Patterns for a Successful Career" },
            { "ul_end": "true" }
        ]
    },
    "programtype": "Diploma",
    "salarystart": 33744,
    "salaryend": 72527
}