{
    "admitreq": { "paragraphs": [{ "style": "p", "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions. An admissions interview will be administered to determineif the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them." }] },
    "programhighlights": { "paragraphs": [{ "style": "p", "content": "This program introduces students to word processing and to many applications in the business world. Skilled Office Administration Assistants are in great demand by both large corporations and small independent businesses.Students will have the opportunity to learn today's most popular software applications. "}] },
    "careeropp": { "paragraphs": [{ "style": "p", "content": "As more employers acquire word processing equipment and programs, the labour market for skilled Office Administration Assistants grows. Graduates may move into supervisory office positions as their careers progress." }] },
    "corecourses": {
        "paragraphs": [{ "style": "p", "content": "Upon completion of the program the participant must demonstrate the following core competencies:" },
            { "ul_start": "true" },
            { "style": "li", "content": "Keyboarding Minimum 25 words per minute (WPM)." },
            { "style": "li", "li_title": "Operating Systems", "content": "Basic level of proficiency in a Windows operating system" },
            { "style": "li", "li_title": "Word Processing", "content": "Intermediate level of proficiency in Microsoft Word" },
            { "style": "li", "li_title": "Spreadsheets", "content": "Basic level of proficiency in Microsoft Excel" },
            { "style": "li", "li_title": "Database Management", "content": "Basic level of proficiency in Microsoft Access" },
            { "style": "li", "li_title": "Business Skills", "content": "Business Correspondence Level 1" },
            { "style": "li", "li_title": "Office Skills", "content": "Basic level of proficiency in Microsoft Outlook, Bookkeeping Level 1 and Level 2, and Office Procedures Level 1" },
            { "style": "li", "li_title": "Accounting", "content": "Sage 50 premium Accounting" },
            { "style": "li", "li_title": "Job Readiness/Employability Skills", "content": "Job Search and Resume Writing" },
            { "ul_end": "true" }
        ]
    },
    "salarystart": 29529,
    "salaryend": 51543
}