{
    "admitreq": { "paragraphs": [{ "style": "p", "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions. An admissions interview will be administered to determineif the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them. Part-time students may set their own schedules to a minimum of two training sessions per week. These times may be scheduled during the day, evenings, or on weekends." }] },
    "programhighlights": { "paragraphs": [{ "style": "p", "content": "The Office Administration Diploma program prepares students to work in an office environment as administrators and assistants. The program provides students with comprehensive knowledge and office skills to make them successful as assistants in business settings. "}] },
    "careeropp": { "paragraphs": [{ "style": "p", "content": "This program prepares students to work in fast-paced office environments as corporate secretaries, executive assistants, office administrators, and special assistants. Upward mobility in this role is possible with experience,motivation, dedication, and a positive attitude. "}] },
    "corecourses": {
        "paragraphs": [{ "style": "p", "content": "Upon completion of the program the participant must demonstrate the following core competencies:" },
            { "ul_start": "true" },
            { "style": "li", "li_title": "Keyboarding", "content": "Minimum 40 words per minute (WPM)." },
            { "style": "li", "li_title": "Operating Systems", "content": "Advanced level of proficiency in a Windows operating system" },
            { "style": "li", "li_title": "Word Processing", "content": "Advanced level of proficiency in Microsoft Word" },
            { "style": "li", "li_title": "Spreadsheets", "content": "Advanced level of proficiency in Microsoft Excel" },
            { "style": "li", "li_title": "Database Management", "content": "Basic level of proficiency in Microsoft Access" },
            { "style": "li", "li_title": "Graphics/Presentation", "content": "Basic level of proficiency in Microsoft PowerPoint and Microsoft Publisher" },
            { "style": "li", "li_title": "Office Skills", "content": "Internet Fundamentals, advanced level of proficiency in Microsoft Outlook, Office Procedures Level1 and Level 2, and Basic Bookkeeping Level 1 and Level 2" },
            { "style": "li", "li_title": "Business Skills", "content": "Grammar Essentials for Business Writing, Business Correspondence Level 1 and Level 2, Customer Service Essentials, Business Planning,Business Math, and Management Fundamentals" },
            { "style": "li", "li_title": "Accounting", "content": "Sage 50 Premium Accounting" },
            { "style": "li", "li_title": "Job Readiness/Employability Skills", "content": "Job Search and Resume Writing and ThoughtPatterns for a Successful Career" },
            { "ul_end": "true" }
        ]
    },
    "salarystart": 29286,
    "salaryend": 53578
}