{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions. An admissions interview will be administered to determineif the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "This program provides students with the necessary skills and knowledge required to perform payroll administrative responsibilities in the payroll department and to apply payroll legislation. Students become familiar withbasic payroll practices and procedures and are eligible to apply to the Canadian Payroll Association (CPA) for Payroll Compliance Practitioner (PCP) certification after having acquired one year of payroll experience. In addition to accounting and payrollexpertise, students gain skills and experience in word processing, spreadsheet applications, telephone communication skills, and performing a job search. "
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "ayroll administrators are employed by payroll administration companies and by other establishments throughout the private and public sectors. Careers that correspond"
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "content": "Benefits Officer"
            },
            {
                "style": "li",
                "content": "Pay and Benefits Administrator/Clerk"
            },
            {
                "style": "li",
                "content": "Salary Administration Officer"
            },
            {
                "style": "li",
                "content": "Pay Advisor/Clerk"
            },
            {
                "style": "li",
                "content": "Payroll Officer/Clerk"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Upon completion of the program the participant must demonstrate the following core competencies:"
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Keyboarding ",
                "content": "Minimum 25 words per minute(WPM)."
            },
            {
                "style": "li",
                "li_title": "Operating Systems",
                "content": "Basic level of proficiency in a Windows operating system"
            },
            {
                "style": "li",
                "li_title": "Word Processing ",
                "content": "Basic level of proficiency in Microsoft Word "
            },
            {
                "style": "li",
                "li_title": "Spreadsheets ",
                "content": "Basic level of proficiency in Microsoft Excel"
            },
            {
                "style": "li",
                "li_title": "Office Skills ",
                "content": "Personal Computer Fundamentals for End Users, Basic Bookkeeping Level 1, and basic level of proficiency in MicrosoftOutlook "
            },
            {
                "style": "li",
                "li_title": "Accounting ",
                "content": "Payroll Compliance Legislation, Payroll Fundamentals Levels 1 and 2, and QuickBooks Premier"
            },
            {
                "style": "li",
                "li_title": "Simulations and Drills ",
                "content": "Practical Applications– 1 Unit "
            },
            {
                "style": "li",
                "li_title": "Business Skills ",
                "content": "Business Math, Business Correspondence Level 1, and Customer Service"
            },
            {
                "style": "li",
                "li_title": "Job Readiness / Employability Skills ",
                "content": "Job Search and Résumé Writingand Thought Patterns for a Successful Career "
            },
            {
                "ul_end": "true "
            }
        ]
    },
    "salarystart": 35226,
    "salaryend": 59936
}