{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instruction. An admissions interview will be administered to determineif the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them. Part-time students may set their own schedules to a minimum of two training sessions per week. These times may be scheduled during the day, evenings, or on weekends."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "This program prepares students to deal with the problems they may encounter when supporting Personal Computers in an office environment. It provides in-depth knowledge of both computer hardware and software, and preparesstudents to take the CompTIA A+, Network+, and Security+ certification exams. Students will have practical hands-on experience in maintenance of PCs, mobile devices, laptops, operating systems and printers, network and network devices, and computer securitysuch as cryptography and access control, as well as business-related topics such as disaster recovery and risk management. Successful students may choose to progress to advanced qualifications such as MCSA. "
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Skilled PC Support Specialists are in high demand in today's skilled environment. Virtually all organizations with multiple computers require the skills of PC Support Specialists who can become invaluable members of a managementteam."
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Upon completion of the program the participant must demonstrate the following core competencies: "
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Operating Systems",
                "content": "Advanced level of proficiency in a Windows operating system"
            },
            {
                "style": "li",
                "li_title": "Word Processing",
                "content": "Intermediate level of proficiency in Microsoft Word"
            },
            {
                "style": "li",
                "li_title": "Spreadsheets",
                "content": "Intermediate level of proficiency in Microsoft Excel"
            },
            {
                "style": "li",
                "li_title": "Graphic/Presentations",
                "content": "Advanced level of proficiency in Microsoft PowerPoint"
            },
            {
                "style": "li",
                "li_title": "Database Management",
                "content": "Advanced level of proficiency in Microsoft Access"
            },
            {
                "style": "li",
                "li_title": "Simulations and Drills",
                "content": "Practical Applications – 2 Units"
            },
            {
                "style": "li",
                "li_title": "Office Skills",
                "content": "Advanced level of proficiency in Microsoft Outlook"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Customer Service and Workplace Success/Intrapreneurship"
            },
            {
                "style": "li",
                "li_title": "PC Troubleshooting",
                "content": "CompTIA A+ 220-1001 and CompTIA A+ 220-1002"
            },
            {
                "style": "li",
                "li_title": "Computer Networking",
                "content": "CompTIANetwork + and CompTIA Security +"
            },
            {
                "style": "li",
                "li_title": "Job Readiness/Employability Skills",
                "content": "Job Search and Résumé Writing and Thought Patterns for a Successful Career"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "salarystart": 34798,
    "salaryend": 69142
}