{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions. An admissions interview will be administered to determineif the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "The Sales Associate program provides students with the sales skills necessary to meet the demands of today's retail business. This program is designed to engage students in basic sales training giving them a good start inany sales position. "
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Sales Associates sell, rent or lease a range of technical and non-technical goods and services directly to consumers. Job titles include: audio equipment salesperson, automobile salesperson, car rental agent, clothing salesperson,computer salesperson – retail, counter clerk – retail, department store clerk, furniture salesperson, hardware store clerk, jewelry salesperson, retail sales associate, retail sales clerk, retail salesperson. "
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Upon completion of the program the participant must demonstrate the following core competencies: "
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Keyboarding",
                "content": "Minimum 25 words per minute (WPM)."
            },
            {
                "style": "li",
                "li_title": "Operating Systems",
                "content": "Basic level of proficiency in a Windows operating system"
            },
            {
                "style": "li",
                "li_title": "Word Processing",
                "content": "Basic level of proficiency in Microsoft Word"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Customer Service Essentials, Business Verbal Communication, Marketing and Sales, Business in the Digital Age, Business Math, Business Negotiations and Contracts, and Principles of Selling"
            },
            {
                "style": "li",
                "li_title": "Simulations and Drills",
                "content": "Practical Applications – 1 Unit"
            },
            {
                "style": "li",
                "li_title": "Job Readiness/Employability Skills",
                "content": "Job Search and Resume Writing"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "salarystart": 22016,
    "salaryend": 41925
}