{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions. Applicants whose first language is not English mustprovide proof of English proficiency."
            },
            {
                "style": "p",
                "content": "In admissions interview will be administered to determine if the applicant has the required interest, motivation, and entry-level skills to take this program."
            },
            {
                "style": "p",
                "content": "Full - time students must attend the required hours per week as per the course schedule and may do so at times convenient to them."
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "In the Software and Web Developer diploma program, students learn the coding languages that every web developer needs to know: HTML, CSS, and JavaScript.Students then broaden their skillset with a strong foundation in SQL, C#, and the.NET Framework that will lead to additional opportunities in the world of software development. "
            },
            {
                "style": "p",
                "content": "Throughout the program, students gain hands - on experience with a range of software development projects that buildin complexity as students add programming skills and languages to their toolkit. "
            },
            {
                "style": "p",
                "content": "Graduates of the program will be able to: "
            },
            {
                "ul_start": "true "
            },
            {
                "style": "li",
                "content": "Design the appearance and layout of websites "
            },
            {
                "style": "li",
                "content": "Develop cross - browser and cross - platform websites "
            },
            {
                "style": "li",
                "content": "Create and optimize content for websites using graphics, databases, animations, and other software "
            },
            {
                "style": "li",
                "content": "Translatewire frames and storyboards into functional, responsive websites "
            },
            {
                "style": "li",
                "content": "Work with MySQL databases and SQL scripting "
            },
            {
                "style": "li",
                "content": "Use the.NET Framework to create robust web applications "
            },
            {
                "ul_end": "true "
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Graduates of the program may pursue a variety of positions in software development, including web developer, UI / UX developer, front end web developer, software developer, HTML / CSS developer, and Javascript / jQuery developer."
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Core Courses"
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Keyboarding",
                "content": "Minimum 25 words per minute (WPM)."
            },
            {
                "style": "li",
                "li_title": " Operating Systems",
                "content": "Intermediate level of proficiencywith Windows OS"
            },
            {
                "style": "li",
                "li_title": "Software Development Industry",
                "content": "Computer and Technology Basics for Developers, Overview of Software Development"
            },
            {
                "style": "li",
                "li_title": "Software and Web Development Skills",
                "content": "Version Control, HTML, CSS and Bootstrap, JavaScript, Visual Studio, C#, .NET Framework"
            },
            {
                "style": "li",
                "li_title": "Database Skills Intermediate level of proficiency in Microsoft Access, Database and SQL"
            },
            {
                "style": "li",
                "li_title": "Word Processing and Spreadsheets",
                "content": "Basic level of proficiency in Microsoft Word and Microsoft Excel"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Customer Service, Project Management "
            },
            {
                "ul_end": "true "
            }
        ]
    },
    "salarystart": 40000,
    "salaryend": 87000
}