{
    "admitreq": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Grade 12 or equivalent or Mature Student Status."
            },
            {
                "style": "p",
                "content": "Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions."
            },
            {
                "style": "p",
                "content": "In admissions interview will be administered to determine if the applicant has the required interest, motivation, and entry level skills to take this program."
            },
            {
                "style": "p",
                "content": "ull-time students must attend the required hoursper week as per the course schedule and may do so at times convenient to them."
            },
            {
                "style": "p",
                "content": "art-time students may set their own schedules to a minimum of two training sessions per week. These times may be scheduled during the day,evening, or on weekends"
            }
        ]
    },
    "programhighlights": {
        "paragraphs": [
            {
                "style": "p",
                "content": "This program provides students with the necessary skills and knowledge to build a web design foundation, learn industry-standard software programs, and produce a well-rounded and exciting portfolio. Students learn how toplan and design compelling and interactive websites and learn to use industry-related programs, such as Adobe Photoshop, Illustrator, Dreamweaver, and Animate, for website designs. Students will also explore HTML and CSS for web publishing alongside essentialtopics, such as accessibility standards, color, typography, and composition, as well as dig into PHP and WordPress development. Web Design graduates develop a professional design process for building a website from concept to launch."
            }
        ]
    },
    "careeropp": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Recent studies indicate that strong growth in web design jobs, particularly in the consulting sector, is expected over the next few years. Career opportunities that will allow students to communicate and captivate with theskills learned in this program include: "
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "content": "Web Designer"
            },
            {
                "style": "li",
                "content": "Internet Site Designer"
            },
            {
                "style": "li",
                "content": "Website Developer"
            },
            {
                "style": "li",
                "content": "IntranetSite Designer"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "corecourses": {
        "paragraphs": [
            {
                "style": "p",
                "content": "Upon completion of the program the participant must demonstrate the following core competencies:"
            },
            {
                "ul_start": "true"
            },
            {
                "style": "li",
                "li_title": "Keyboarding",
                "content": "Minimum 25 words per minute (WPM)."
            },
            {
                "style": "li",
                "li_title": "Operating Systems",
                "content": "Basic level of proficiency in a Windows operating system"
            },
            {
                "style": "li",
                "li_title": "Word Processing",
                "content": "Basic level of proficiency in Microsoft Word"
            },
            {
                "style": "li",
                "li_title": "Office Skills",
                "content": "Internet Fundamentals, Personal Computer Fundamentals for Technical Users, and basis level of proficiency in Microsoft Outlook"
            },
            {
                "style": "li",
                "li_title": "Business Skills",
                "content": "Workplace Success/Intrapreneurship,Marketing and Sales, and Customer Service"
            },
            {
                "style": "li",
                "li_title": "Web Design",
                "content": "Introduction to Web Design, Web 101, HTML and CSS Essentials, Color Theory, Fundamentals of Typography, Dreamweaver 1 and 2, Information Design, Animate,JavaScript for Designers, Web Design 1, Dynamic Web Development with PHP, WordPress Development, Web Practical Simulation, and Web Portfolio Design"
            },
            {
                "style": "li",
                "li_title": "Graphics/Presentation",
                "content": "Photoshop Basics and IllustratorBasics"
            },
            {
                "style": "li",
                "li_title": "Job Readiness/Employability Skills",
                "content": "Job Search and Résumé Writing and Thought Patterns for a Successful Career"
            },
            {
                "ul_end": "true"
            }
        ]
    },
    "salarystart": 33516,
    "salaryend": 76895
}